function Pet(name) {
    this.name = name;
    this.hunger = 100;
    this.fun = 100;
    this.type = randomPet();

    this.feed = function(food) {
        this.hunger += food;
        this.fun -= 5;
    };


    this.play = function(fun) {
        this.fun += fun;
        this.hunger -= 5;
    };
}

function randomPet() {
    var petList = ["🐶", "🐱", "🐭", "🐹", "🐰", "🐻", "🐼", "🐨", "🐯", "🦁", "🐮", "🐷", "🐽", "🐸", "🐙", "🐵", "🙈", "🙉", "🙊", "🐒", "🐔", "🐧", "🐦", "🐤", "🐣", "🐥", "🐺", "🐗", "🐴", "🦄", "🐝", "🐛", "🐌", "🐞", "🐜", "🕷", "🦂", "🦀", "🐍", "🐢", "🐠", "🐟", "🐡", "🐬", "🐳", "🐋", "🐊", "🐆", "🐅", "🐃", "🐂", "🐄", "🐪", "🐫", "🐘", "🐐", "🐏", "🐑", "🐎", "🐖", "🐀", "🐁", "🐓", "🦃", "🕊", "🐕", "🐩", "🐈", "🐇", "🐿", "🐉", "🐲"];

    return petList[Math.floor(Math.random() * petList.length)];
}